<?php

return [
    'stones' => [
        [
            'name' => 'наношпинель',
            'alt_name' => 'шпинель синтетическая',
            'description' => 'Наношпинель считается синтетическим аналогом шпинели, обладающим высокой прочностью. Именно эти качества позволяют использовать кристалл для создания самых разнообразных ювелирных украшений.',
            'origin' => 'имитация',
            'colour' => ['красный','синий','фиолетовый','оранжевый','розовый','зеленый','черный'],
            'optical_effect' => null,
        ],
        [
            'name' => 'фианит',
            'alt_name' => 'бриллиант имитация',
            'description' => 'Фианит - это искусственно выращенный кристалл, диоксид циркония, который часто используется в ювелирном деле для имитации бриллиантов.',
            'origin' => 'имитация',
            'colour' => ['красный','синий','фиолетовый','оранжевый','розовый','зеленый','черный'],
            'optical_effect' => null,
        ]
    ]
];
