<?php
declare(strict_types=1);

use Domain\Inserts\StoneGrades\Enums\StoneGradeBuilderEnum;

return [
    'family' => [
        ['name' => 'алмаз', 'description'        => 'Алмаз — это необработанный бриллиант, наиболее твердый из минералов и дорогой среди драгоценных камней.'],
        ['name' => 'корунд', 'description'       => 'Корунды – это вторая после алмазов группа минералов относящаяся к драгоценным и включает такие камни как Сапфир и Рубин'],
        ['name' => 'берилл', 'description'       => 'Берилл это группа из драгоценных и ювелирных минералов, включающая такие камни как Аквамарин, Изумруд, Морганит '],
        ['name' => 'хризоберилл', 'description'  => 'Хризоберилл драгоценный минерал, самый известный камень этой группы Алксандрит'],
        ['name' => 'полевой шпат', 'description' => 'Группа ювелирных камней полевой шпат включают в себя Амазонит, Лабрадорит, Лунный камень. '],
        ['name' => 'гранат', 'description'       => 'Гранаты являются одной из старейших и наиболее важных групп цветных ювелирных камней. Гроссуляр, Спессартин входят в эту группу'],
        ['name' => 'жадеит', 'description'       => 'Ювелирно-поделочный минерад в основном зеленого цвета различных оттенков, известный с самой древности. Нефрит относится к этой группе'],
        ['name' => 'опал', 'description'         => 'Опалы — разделяются на благородные ювелирные и обыкновенные ювелирно-поделочные разнообразных цветов.'],
        ['name' => 'кварц', 'description'        => 'Кварц является вторым наиболее распространенным минералом на земле после полевого шпата, группа включает Агат, Аметист, Авантюрин, Сердолик, Оникс и другие'],
        ['name' => 'шпинель', 'description'      => 'Ювелирные камни шпинели обладают превосходной твердостью и долговечностью. Красная и сапфировая шпинель, Герцинит, Рубицелль'],
        //        ['name' => 'сподумен', 'description'     => 'Сподумен это минерал пироксен ювелирного качества, получивший свое название от греческого слова «сподуменос», что означает «пепельный цвет»'],
        ['name' => 'топаз', 'description'        => 'Топаз — очень важная группа драгоценных камней, широко используемых в коммерческих ювелирных изделиях.'],
        ['name' => 'турмалин', 'description'     => 'Турмалин является одной из самых универсальных групп ювелирных камней и включает в себя ряд видов и разновидностей ювелирных камней'],
        ['name' => 'циркон', 'description'       => 'Циркон — это полностью естественная группа драгоценных камней с древней историей, насчитывающей более 4 миллиардов лет.'],
        ['name' => 'цоизит', 'description'       => 'Цоизит — важная группа драгоценных камней, в которую входят одни из самых популярных драгоценных камней нашего времени.'],
        ['name' => 'биоген', 'description'       => 'Биоген это вещество производимое живыми организмами'],

    ],
    'optical_effects' => [
        ['name' => 'кошачий глаз', 'description'       => 'эффект, когда на поверхности камня видна узкая полоска света, напоминающая кошачий зрачок'],
        ['name' => 'астеризм', 'description'           => 'Астеризм или эффект звезды. Этот эффект заключается в том, что на поверхности камня при попадании на него света, появляются светлые полоски пересекающиеся в одной точке и напоминающих звездные лучи.'],
        ['name' => 'изменчивость цвета', 'description' => ' Плеохроизм - волшебный эффект, позволяющий некоторым драгоценным камням менять цвет, если смотреть на них под разными углами или при разном освещении.'],
        ['name' => 'адуляресценция', 'description'     => 'Оптический эффект, проявляющийся в виде голубоватого или серебристого мерцания, которое возникает при вращении лунного камня (адуляра) или других полевых шпатов'],
        ['name' => 'опалесценция', 'description'       => 'Оптический эффект разделения света на множество цветовых лучей, который усиливает радужную игру красок в камне.'],
    ],
];
