<?php

return [
    'jw_categories' => [
        'браслеты','броши','зажим для галстука','запонки','колье','кольца','пирсинг','подвески','подвески-шарм',
        'серьги','цепи','бусы'
    ],
    'medias' => [
        'video_types' => [
            'video/ogv', 'video/webm', 'video/mp4'
        ],
        'jw_media_producers' => [
            'manager', 'customer'
        ],
        'jw_media_categories' => [
            'video', 'image'
        ]
    ],
    'jw_weavings' => [
        'бисмарк', 'бисмарк двойной', 'гарибальди', 'колос', 'лав', 'нонна', 'панцирное', 'панцирное двойное', 'питон',
        'ролло', 'ромб двойной', 'ромб тройной', 'сингапур', 'скорпион', 'снейк', 'улитка', 'фантазийное', 'фигаро',
        'якорное', 'якорь бриллиантовый', 'без плетения'
    ],
    'body_parts' => [
        'запястье', 'щиколотка'
    ],
    'bracelet_bases' => [
        'металлическая', 'шнурок', 'леска', 'кожаная'
    ],
    'bead_bases' => [
        'леска нейлоновая', 'шелковая нить', 'ювелирный тросик'
    ],
    'earring_clasps' => [
        [
            'name' => 'пусет',
            'description' => 'Замок имеет вид зажима, который примыкает к уху через продетый сквозь отверстие штифт.'
        ],
        [
            'name' => 'английский',
            'description' => 'Самый прочный и удобный замок, штифт изделия продевают в отверстие мочки уха и защелкивают швензой.'
        ],
        [
            'name' => 'булавка',
            'description' => 'При таком типе замка короткая швенза продевается в петельку. Это вариант замка для серёг преимущественно круглых форм.',
        ],
        [
            'name' => 'французский',
            'description' => 'По внешнему виду похож на петельку, но с застёжкой снизу. Замок достаточно надёжный, однако дужка замковой части, как правило, тонкая и склонна к деформациям.',
        ],
        [
            'name' => 'итальянский',
            'description' => 'Выглядит, как гвоздик с фиксатором. Штифт серьги продевается в ухо и закрепляется при помощи крупной петли, охватывающей мочку.'
        ],
        [
            'name' => 'протяжка',
            'description' => 'Замок цепочка продевается в мочку, оставляя на ее лицевой стороне основной, верхний элемент серьги.'
        ],
        [
            'name' => 'скоба',
            'description' => 'Подвижная швенза продевается сквозь мочку и крепится при помощи специального шарика на серьге.'
        ],
        [
            'name' => 'кольцо',
            'description' => 'Застежка с короткой прямой швензой, которая вдевается в противоположный конец серьги. Замок получается скрытым, его не видно при ношении.'
        ],
        [
            'name' => 'кафф',
            'description' => 'Замок комбинированный и может сочетать в себе два вида крепления к уху: гвоздик/пусета и зажим. Серьги с таким замком могут быть достаточно крупными'
        ],
        [
            'name' => 'зажим',
            'description' => 'Передняя и задняя части сережки точно повторяют форму уха, лишь слегка прилегая к нему. Снизу серьги-зажимы сплошные и облегают мочку уха, к верху – раздваиваются по своей форме.'
        ],
        [
            'name' => 'петля',
            'description' => 'Дужка опускается ниже мочки уха. Данный тип замка - простейший, как таковое крепление отсутствует, но форма и размер петли позволяют удерживать серьгу в ухе и, благодаря своей гибкости, немного регулировать ее положение под тип мочки.'
        ],
    ],
    'earring_types' => [
        [
            'name' => 'диорки',
            'description' => 'Двусторонние серьги называют диорками в честь бренда их создавшего - Dior. Пусеты нестандартной формы, состоящие из двух шариков. Особенность модели в том, что и передняя, и задняя часть украшения играют декоративную роль.'
        ],
        [
            'name' => 'джекеты',
            'description' => 'Представляют собой гвоздики, украшенные камнями или фигурным ювелирным металлом. Главный элемент серьги является застёжкой и располагается сзади, виднеясь из-под мочки уха. Лицевой элемент серьги - ее основа, которая всегда меньше по размеру замкового элемента.'
        ],
        [
            'name' => 'подвески',
            'description' => 'Этот тип серег состоит из трёх частей: застёжки, основы и подвижной подвески. Они могут быть длинными или короткими, полыми или массивными. '
        ],
        [
            'name' => 'калачи',
            'description' => 'Серьги калачи – это украшения грушевидной или округлой формы, пустотелые внутри, без дополнительных элементов в виде камней или вставок.'
        ],
        [
            'name' => 'капельки',
            'description' => 'У серег-капелек основной элемент выполнен в форме капли. Эти серьги являются классикой, они лаконичны и женственны. Роль капли, как правило, выполняет жемчужная вставка или подвесной элемент, инкрустированный сияющими камнями.'
        ],
        [
            'name' => 'каффы',
            'description' => 'Серьги каффы — это особый вид украшений, которые крепятся к уху без необходимости прокалывать несколько дырок. Они обычно обхватывают внешнюю часть ушной раковины, создавая эффектное и необычное украшение.'
        ],
        [
            'name' => 'кисточки',
            'description' => 'В серьгах-кисточках декоративный элемент выполнен в виде воздушной кисти, которая может быть изготовлена из нитей текстиля, кожи, металла, камней.'
        ],
        [
            'name' => 'клаймеры',
            'description' => 'Серьги-клаймеры напоминают каффы, но они гораздо миниатюрнее и тоньше, с одинарным типом замка – зажимом. Такие серьги повторяют аккуратные ушные изгибы, не выступая за пределы мочки и не доходя до хрящика.'
        ],
        [
            'name' => 'кольца',
            'description' => 'Серьги-кольца – одни из самых древних видов серег. Конструкция серег данного типа простая и надежная.'
        ],
        [
            'name' => 'конго',
            'description' => 'Серьги-кольца диаметром более 2 см'
        ],
        [
            'name' => 'шандельеры',
            'description' => 'Серьги-шандельеры получили свое название из-за схожести с многоярусными люстрами дорогих казенных и развлекательных заведений. У мочки уха они узкие, расширяющиеся книзу. Декор таких украшений изобилует драгоценными камнями, ажуром, перьями, кистями и другим.'
        ],
        [
            'name' => 'моносерьги',
            'description' => 'Моносерьги – создают ассиметричность, носятся в одном ухе, представляют собой пару серег различных по форме, размеру и типу замка, но надеваемых одновременно.'
        ],
        [
            'name' => 'продевки',
            'description' => 'Серьги-продевки – украшения которые, как правило, состоят из центрального декоративного элемента и цепи с маленьким штифтом на конце.'
        ],
        [
            'name' => 'пусеты',
            'description' => 'Могут быть самых разнообразных форм и размеров: от классического одиночного маленького камня в круглой оправе или минималистичного металлического шарика до группы миксованных камней в единой композиции и орнаментальных рисунков, заключенных в разнообразные металлические формы.'
        ],
    ],
    'jw_clasps' => [
        'карабин', 'шпрингель', 'коробка','резьбовая','магнитная','тогл','крючок','складная','слайдер','шарнир',
        'без замка'
    ],
    'length_names' => [
        ['name' => 'коллар', 'description' => 'Это шейное украшение плотно надевается на шею и лучше всего носить с одеждой с открытым вырезом (например, с круглым вырезом, V-образным вырезом, с открытыми плечами и без бретелек).'],
        ['name' => 'чокер', 'description' => 'Чокеры располагаются у основания шеи на шейной кости. Их можно сочетать практически с любым модным стилем.'],
        ['name' => 'принцесса', 'description' => 'Украшения длиной "Принцесса" один из самых популярных размеров, которое доходит чуть ниже ключиц; Лучше всего подходит для крепления кулона с бриллиантами или драгоценными камнями. Это шейное украшение универсально; Его можно носить с любым нарядом.'],
        ['name' => 'матине', 'description' => 'Длина украшения "Матине" является популярной длиной для многослойности, создается путем ношения от двух до четырех украшений одновременно для образа, привлекающего внимание. Утренние украшения опускаются ниже ключиц. Они отлично подходят для деловой и повседневной носки.'],
        ['name' => 'опера', 'description' => 'Шейные украшения длиной длиной "Опера" висит ниже груди и достаточной длины, чтобы украшение можно было носить как одну нить, либо обернуть или завязать узлом для создания иллюзии двойной нити, также может использоваться для многослойности. Красиво подчеркнет деловой и вечерний наряд.'],
        ['name' => 'роп', 'description' => 'Шейные украшения длиной "Роп" можно носить несколькими способами (например, обернуть, наложить или завязать узлом) для создания изысканного, но элегантного образа. Прелесть украшения этой длины в том, что оно может плавно переходить из офиса в ресторан.'],
    ],
    'bracelet_sizes' => [
        ['value' => 15, 'unit' => 'см'],
        ['value' => 16, 'unit' => 'см'],
        ['value' => 16.5, 'unit' => 'см'],
        ['value' => 17, 'unit' => 'см'],
        ['value' => 17.5, 'unit' => 'см'],
        ['value' => 18, 'unit' => 'см'],
        ['value' => 18.5, 'unit' => 'см'],
        ['value' => 19, 'unit' => 'см'],
        ['value' => 19.5, 'unit' => 'см'],
        ['value' => 20, 'unit' => 'см'],
        ['value' => 21, 'unit' => 'см'],
        ['value' => 22, 'unit' => 'см'],
        ['value' => 23, 'unit' => 'см'],
        ['value' => 24, 'unit' => 'см'],
        ['value' => 25, 'unit' => 'см'],
    ],
    'ring_sizes' => [
        ['value' => 15, 'unit' => 'мм'],
        ['value' => 15.5, 'unit' => 'мм'],
        ['value' => 16, 'unit' => 'мм'],
        ['value' => 16.5, 'unit' => 'мм'],
        ['value' => 17, 'unit' => 'мм'],
        ['value' => 17.5, 'unit' => 'мм'],
        ['value' => 18, 'unit' => 'мм'],
        ['value' => 18.5, 'unit' => 'мм'],
        ['value' => 19, 'unit' => 'мм'],
        ['value' => 19.5, 'unit' => 'мм'],
        ['value' => 20, 'unit' => 'мм'],
        ['value' => 20.5, 'unit' => 'мм'],
        ['value' => 21, 'unit' => 'мм'],
        ['value' => 21.5, 'unit' => 'мм'],
        ['value' => 22, 'unit' => 'мм'],
        ['value' => 22.5, 'unit' => 'мм'],
    ],
    'chain_sizes' => [
        ['value' => 35, 'unit' => 'см'],
        ['value' => 40, 'unit' => 'см'],
        ['value' => 45, 'unit' => 'см'],
        ['value' => 50, 'unit' => 'см'],
        ['value' => 55, 'unit' => 'см'],
        ['value' => 60, 'unit' => 'см'],
        ['value' => 65, 'unit' => 'см'],
        ['value' => 70, 'unit' => 'см'],
        ['value' => 75, 'unit' => 'см'],
        ['value' => 80, 'unit' => 'см'],
        ['value' => 85, 'unit' => 'см'],
        ['value' => 90, 'unit' => 'см'],
        ['value' => 95, 'unit' => 'см'],
        ['value' => 100, 'unit' => 'см'],
        ['value' => 105, 'unit' => 'см'],
        ['value' => 110, 'unit' => 'см'],
    ],
    'necklace_sizes' => [
        ['value' => 35, 'unit' => 'см'],
        ['value' => 40, 'unit' => 'см'],
        ['value' => 45, 'unit' => 'см'],
        ['value' => 50, 'unit' => 'см'],
        ['value' => 60, 'unit' => 'см'],
        ['value' => 70, 'unit' => 'см'],
        ['value' => 75, 'unit' => 'см'],
        ['value' => 80, 'unit' => 'см'],
        ['value' => 85, 'unit' => 'см'],
        ['value' => 90, 'unit' => 'см'],
        ['value' => 95, 'unit' => 'см'],
        ['value' => 100, 'unit' => 'см'],
        ['value' => 105, 'unit' => 'см'],
        ['value' => 110, 'unit' => 'см'],
    ],
    'bead_sizes' => [
        ['value' => 35, 'unit' => 'см'],
        ['value' => 40, 'unit' => 'см'],
        ['value' => 45, 'unit' => 'см'],
        ['value' => 50, 'unit' => 'см'],
        ['value' => 55, 'unit' => 'см'],
        ['value' => 60, 'unit' => 'см'],
        ['value' => 65, 'unit' => 'см'],
        ['value' => 70, 'unit' => 'см'],
        ['value' => 75, 'unit' => 'см'],
        ['value' => 80, 'unit' => 'см'],
        ['value' => 85, 'unit' => 'см'],
        ['value' => 90, 'unit' => 'см'],
        ['value' => 95, 'unit' => 'см'],
        ['value' => 100, 'unit' => 'см'],
        ['value' => 105, 'unit' => 'см'],
        ['value' => 110, 'unit' => 'см'],
    ],
    'stones' => [
        [
            'stone_type_id' => 1,
            'name' => 'бриллиант',
            'description' => 'Бриллиант это обработанный для ювелирного изделия алмаз. Самый твердый ',
            'is_natural' => 1,
        ],
        [
            'stone_type_id' => 1,
            'name' => 'сапфир',
            'description' => 'Сапфир это натуральный драгоценный камень',
            'is_natural' => 1,
        ],
        [
            'stone_type_id' => 2,
            'name' => 'фианит',
            'description' => 'Фианит - искусственно выращенный полудрагоценный камень',
            'is_natural' => 0,
        ],
        [
            'stone_type_id' => 2,
            'name' => 'топаз',
            'description' => 'Топаз это натуральный полудрагоценный камень',
            'is_natural' => 1,
        ],
        [
            'stone_type_id' => 2,
            'name' => 'гранат',
            'description' => 'Гранат это натуральный полудрагоценный камень',
            'is_natural' => 1,
        ],
        [
            'stone_type_id' => 2,
            'name' => 'аметист',
            'description' => 'Аметист это натуральный полудрагоценный камень',
            'is_natural' => 1,
        ],
        [
            'stone_type_id' => 1,
            'name' => 'жемчуг',
            'description' => 'Жемчуг это натуральный драгоценный камень',
            'is_natural' => 1,
        ],
        [
            'stone_type_id' => 3,
            'name' => 'агат',
            'description' => 'Агат это натуральный поделочный камень',
            'is_natural' => 1,
        ],
        [
            'stone_type_id' => 3,
            'name' => 'малахит',
            'description' => 'Малахит это натуральный поделочный камень',
            'is_natural' => 1,
        ],
        [
            'stone_type_id' => 2,
            'name' => 'камея',
            'description' => 'Камея это натуральный резной полудрагоценный камень',
            'is_natural' => 1,
        ],
        [
            'stone_type_id' => 1,
            'name' => 'изумруд',
            'description' => 'Изумруд это натуральный драгоценный камень',
            'is_natural' => 1,
        ],
        [
            'stone_type_id' => 1,
            'name' => 'корунд',
            'description' => 'Корунд это натуральный драгоценный камень',
            'is_natural' => 1,
        ],
        [
            'stone_type_id' => 1,
            'name' => 'александрит гидротермальный',
            'description' => 'Александрит гидротермальный это синтетический драгоценный камень',
            'is_natural' => 0,
        ],
        [
            'stone_type_id' => 2,
            'name' => 'празиолит',
            'description' => 'Празиолит это отожженный или облученный аметист, имеет зеленый цвет',
            'is_natural' => 1,
        ],
        [
            'stone_type_id' => 2,
            'name' => 'цитрин',
            'description' => 'Разновидность кварца лимонно-желтого цвета',
            'is_natural' => 1,
        ],
        [
            'stone_type_id' => 2,
            'name' => 'горный хрусталь',
            'description' => 'Разновидность прозрачного бесцветного кварца ',
            'is_natural' => 1,
        ],
        [
            'stone_type_id' => 1,
            'name' => 'танзанит',
            'description' => 'При открытии камня в 1967 году, танзанит был отмечен специалистами, как «драгоценный камень 20-го столетия».',
            'is_natural' => 1,
        ],
        [
            'stone_type_id' => 1,
            'name' => 'наношпинель',
            'description' => 'Наношпинель – синтетический аналог натурального камня',
            'is_natural' => 0,
        ],
        [
            'stone_type_id' => 1,
            'name' => 'янтарь',
            'description' => 'Наношпинель – синтетический аналог натурального камня',
            'is_natural' => 0,
        ],
    ],
    'jw_promotions' => [
        [
            'name' => 'аутлет 70%',
            'rate' => 0.7,
        ],
        [
            'name' => 'золото и серебро 55%',
            'rate' => 0.55,
        ],
        [
            'name' => 'бриллианты 45%',
            'rate' => 0.45,
        ],
        [
            'name' => 'онлайн 40%',
            'rate' => 0.4,
        ],
        [
            'name' => 'бонусы 40%',
            'rate' => 0.4,
        ],
        [
            'name' => 'шок цена',
            'rate' => 0,
        ],
    ],
    'prcs_metal_colours' => [
        'желтый','белый','красный','комбинированный','платиновый оттенок', 'черненый белый'
    ],
    'jw_coverages' => [
        'золочение','родирование','эмаль','алмазная грань', 'оксидирование'
    ],
    'prcs_metal_hallmarks' => [
        375,500,585,750,875,916,958,999,800,830,925,960,850,900,950
    ],
    'prcs_metals' => [
        'золото','серебро','платина','палладий'
    ],
];
