<?php

return [
    'jw_categories' => [
        'браслеты','броши','зажим для галстука','запонки','колье','кольца','пирсинг','подвески','подвески-шарм',
        'серьги','цепи'
    ],
    'medias' => [
        'video_types' => [
            'video/ogv', 'video/webm', 'video/mp4'
        ],
        'jw_media_producers' => [
            'manager', 'customer'
        ],
        'jw_media_categories' => [
            'video', 'image'
        ]
    ],
    'jw_weavings' => [
        'бисмарк', 'бисмарк двойной', 'гарибальди', 'колос', 'лав', 'нонна', 'панцирное', 'панцирное двойное', 'питон',
        'ролло', 'ромб двойной', 'ромб тройной', 'сингапур', 'скорпион', 'снейк', 'улитка', 'фантазийное', 'фигаро',
        'якорное', 'якорь бриллиантовый', 'без плетения'
    ],
    'body_parts' => [
        'запястье', 'щиколотка'
    ],
    'earring_clasps' => [
        'пусет', 'английский', 'французский', 'итальянский', 'протяжка', 'булавка', 'скоба', 'кольцо', 'кафф', 'зажим',
    ],
    'jw_clasps' => [
        'карабин', 'шпрингель', 'коробка','резьбовая','магнитная','тогл','крючок','складная','слайдер','шарнир',
        'без замка'
    ],
    'bracelet_sizes' => [
        ['value' => 15, 'unit' => 'см'],
        ['value' => 16, 'unit' => 'см'],
        ['value' => 16.5, 'unit' => 'см'],
        ['value' => 17, 'unit' => 'см'],
        ['value' => 17.5, 'unit' => 'см'],
        ['value' => 18, 'unit' => 'см'],
        ['value' => 18.5, 'unit' => 'см'],
        ['value' => 19, 'unit' => 'см'],
        ['value' => 19.5, 'unit' => 'см'],
        ['value' => 20, 'unit' => 'см'],
        ['value' => 21, 'unit' => 'см'],
        ['value' => 22, 'unit' => 'см'],
        ['value' => 23, 'unit' => 'см'],
        ['value' => 24, 'unit' => 'см'],
        ['value' => 25, 'unit' => 'см'],
    ],
    'ring_sizes' => [
        ['value' => 15, 'unit' => 'мм'],
        ['value' => 15.5, 'unit' => 'мм'],
        ['value' => 16, 'unit' => 'мм'],
        ['value' => 16.5, 'unit' => 'мм'],
        ['value' => 17, 'unit' => 'мм'],
        ['value' => 17.5, 'unit' => 'мм'],
        ['value' => 18, 'unit' => 'мм'],
        ['value' => 18.5, 'unit' => 'мм'],
        ['value' => 19, 'unit' => 'мм'],
        ['value' => 19.5, 'unit' => 'мм'],
        ['value' => 20, 'unit' => 'мм'],
        ['value' => 20.5, 'unit' => 'мм'],
        ['value' => 21, 'unit' => 'мм'],
        ['value' => 21.5, 'unit' => 'мм'],
        ['value' => 22, 'unit' => 'мм'],
        ['value' => 22.5, 'unit' => 'мм'],
    ],
    'chain_sizes' => [
        ['value' => 35, 'unit' => 'см'],
        ['value' => 40, 'unit' => 'см'],
        ['value' => 45, 'unit' => 'см'],
        ['value' => 50, 'unit' => 'см'],
        ['value' => 55, 'unit' => 'см'],
        ['value' => 60, 'unit' => 'см'],
        ['value' => 65, 'unit' => 'см'],
        ['value' => 70, 'unit' => 'см'],
        ['value' => 75, 'unit' => 'см'],
        ['value' => 80, 'unit' => 'см'],
    ],
    'necklace_sizes' => [
        ['value' => 35, 'unit' => 'см'],
        ['value' => 42, 'unit' => 'см'],
        ['value' => 45, 'unit' => 'см'],
        ['value' => 50, 'unit' => 'см'],
        ['value' => 60, 'unit' => 'см'],
        ['value' => 70, 'unit' => 'см'],
        ['value' => 75, 'unit' => 'см'],
        ['value' => 80, 'unit' => 'см'],
        ['value' => 90, 'unit' => 'см'],
        ['value' => 110, 'unit' => 'см'],
    ],

    'stone_colours' => [
        'зеленый','красный','синий','розовый','голубой','пурпурный','желтый','белый','черный','радужный',
        'гранатовый','бесцветный','сиреневый','коричневый','зеленовато-синий, фиолетовый'
    ],
    'stone_shapes' => [
        'квадратный кушон', 'кушон', 'овал', 'радиант', 'груша', 'ашер', 'сердце', 'изумрудная', 'круг', 'триллион',
        'кабашон', 'маркиз', 'октагон', 'багет'
    ],
    'stones' => [
        [
            'stone_type_id' => 1,
            'name' => 'бриллиант',
            'description' => 'Бриллиант натуральный драгоценный камень',
            'is_natural' => 1,
        ],
        [
            'stone_type_id' => 2,
            'name' => 'фианит',
            'description' => 'Фианит - искусственно выращенный полудрагоценный камень',
            'is_natural' => 0,
        ],
        [
            'stone_type_id' => 2,
            'name' => 'топаз',
            'description' => 'Топаз это натуральный полудрагоценный камень',
            'is_natural' => 1,
        ],
        [
            'stone_type_id' => 1,
            'name' => 'сапфир',
            'description' => 'Сапфир это натуральный драгоценный камень',
            'is_natural' => 1,
        ],
        [
            'stone_type_id' => 2,
            'name' => 'гранат',
            'description' => 'Гранат это натуральный полудрагоценный камень',
            'is_natural' => 1,
        ],
        [
            'stone_type_id' => 2,
            'name' => 'аметист',
            'description' => 'Аметист это натуральный полудрагоценный камень',
            'is_natural' => 1,
        ],
        [
            'stone_type_id' => 1,
            'name' => 'жемчуг',
            'description' => 'Жемчуг это натуральный драгоценный камень',
            'is_natural' => 1,
        ],
        [
            'stone_type_id' => 3,
            'name' => 'агат',
            'description' => 'Агат это натуральный поделочный камень',
            'is_natural' => 1,
        ],
        [
            'stone_type_id' => 3,
            'name' => 'малахит',
            'description' => 'Малахит это натуральный поделочный камень',
            'is_natural' => 1,
        ],
        [
            'stone_type_id' => 2,
            'name' => 'камея',
            'description' => 'Камея это натуральный резной полудрагоценный камень',
            'is_natural' => 1,
        ],
        [
            'stone_type_id' => 1,
            'name' => 'изумруд',
            'description' => 'Изумруд это натуральный драгоценный камень',
            'is_natural' => 1,
        ],
        [
            'stone_type_id' => 1,
            'name' => 'корунд',
            'description' => 'Корунд это натуральный драгоценный камень',
            'is_natural' => 1,
        ],
        [
            'stone_type_id' => 1,
            'name' => 'александрит гидротермальный',
            'description' => 'Александрит гидротермальный это синтетический драгоценный камень',
            'is_natural' => 0,
        ],
        [
            'stone_type_id' => 2,
            'name' => 'празиолит',
            'description' => 'Празиолит это отожженный или облученный аметист, имеет зеленый цвет',
            'is_natural' => 1,
        ],
        [
            'stone_type_id' => 2,
            'name' => 'цитрин',
            'description' => 'Разновидность кварца лимонно-желтого цвета',
            'is_natural' => 1,
        ],
        [
            'stone_type_id' => 2,
            'name' => 'горный хрусталь',
            'description' => 'Разновидность прозрачного бесцветного кварца ',
            'is_natural' => 1,
        ],
        [
            'stone_type_id' => 1,
            'name' => 'танзанит',
            'description' => 'При открытии камня в 1967 году, танзанит был отмечен специалистами, как «драгоценный камень 20-го столетия».',
            'is_natural' => 1,
        ],
        [
            'stone_type_id' => 1,
            'name' => 'наношпинель',
            'description' => 'Наношпинель – синтетический аналог натурального камня',
            'is_natural' => 0,
        ],
    ],
    'stone_types' => [
        'драгоценные', 'полудрагоценные', 'поделочные'
    ],
    'jw_promotions' => [
        [
            'name' => 'аутлет 70%',
            'rate' => 0.7,
        ],
        [
            'name' => 'золото и серебро 55%',
            'rate' => 0.55,
        ],
        [
            'name' => 'бриллианты 45%',
            'rate' => 0.45,
        ],
        [
            'name' => 'онлайн 40%',
            'rate' => 0.4,
        ],
        [
            'name' => 'бонусы 40%',
            'rate' => 0.4,
        ],
        [
            'name' => 'шок цена',
            'rate' => 0,
        ],
    ],
    'prcs_metal_colours' => [
        'желтый','белый','красный','комбинированный','платиновый оттенок', 'черненый белый'
    ],
    'jw_coverages' => [
        'золочение','родирование','эмаль','алмазная грань', 'оксидирование'
    ],
    'prcs_metal_hallmarks' => [
        375,500,585,750,875,916,958,999,800,830,925,960,850,900,950
    ],
    'prcs_metals' => [
        'золото','серебро','платина','палладий'
    ],
];
